<!DOCTYPE html>
<html lang="en">
<head>
  
    <title>0x02 Advanced Windows Internals :: Tx0actical&#39;s Blog</title>
  
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content="Writing Windows KMDF Drivers for Fun and Profit - Part 2" />
<meta name="keywords" content=", " />
<meta name="robots" content="noodp" />

<link rel="canonical" href="https://Tx0actical.github.io/posts/win-drivers/win-drivers-p2/" />






  
  
  
  <link rel="stylesheet" href="https://Tx0actical.github.io/css/blue-local.css">







  <link rel="shortcut icon" href="https://Tx0actical.github.io/img/theme-colors/blue.png">
  <link rel="apple-touch-icon" href="https://Tx0actical.github.io/img/theme-colors/blue.png">



<meta name="twitter:card" content="summary" />

  
    <meta name="twitter:site" content="https://twitter.com/Tx0actical" />
  
    <meta name="twitter:creator" content="Tx0actical" />



<meta property="og:locale" content="en" />
<meta property="og:type" content="article" />
<meta property="og:title" content="0x02 Advanced Windows Internals">
<meta property="og:description" content="Writing Windows KMDF Drivers for Fun and Profit - Part 2" />
<meta property="og:url" content="https://Tx0actical.github.io/posts/win-drivers/win-drivers-p2/" />
<meta property="og:site_name" content="Tx0actical&#39;s Blog" />

  
  

</code></pre><p>This returns the address of <strong>Process Environment Block</strong> (PEB) which is the user-mode representation of the process. It contains the information by image loader, heap manager, and other Windows components that need access to it from user mode. This corresponds to the image -&gt; <code>DbgX.Shell.exe</code> (which is the current debug shell process). To examine its <code>peb</code> we need to switch the current context to that process, this can be done using <code>.process /p</code> with the process address, <code>0xffff9f016a6e4080</code> in this case. Then examine the <code>peb</code> using <code>!peb</code> with the address passed as a parameter, which is <code>0x293d469000</code>. The complete command is -&gt; <code>.process /p ffff9f016a6e4080; !peb 293d469000</code>.</p>
<pre tabindex="0"><code class="language-dbgcmd" data-lang="dbgcmd">lkd&gt; .process /p ffff9f016a6e4080; !peb 293d469000
Implicit process is now ffff9f01`6a6e4080
PEB at 000000293d469000
    InheritedAddressSpace:    No
    ReadImageFileExecOptions: No
    BeingDebugged:            No
    ImageBaseAddress:         00007ff7fa6e0000
    NtGlobalFlag:             0
    NtGlobalFlag2:            0
    Ldr                       00007ff90a2fc4c0
    Ldr.Initialized:          Yes
    Ldr.InInitializationOrderModuleList: 000001e52e003e00 . 000001e558d8f240
    Ldr.InLoadOrderModuleList:           000001e52e003f70 . 000001e558d8f220
    Ldr.InMemoryOrderModuleList:         000001e52e003f80 . 000001e558d8f230
                    Base TimeStamp                     Module
            7ff7fa6e0000 61735063 Oct 22 16:59:31 2021 C:\Program Files\WindowsApps\Microsoft.WinDbg_1.2210.3001.0_x64__8wekyb3d8bbwe\DbgX.Shell.exe
            7ff90a190000 b5ced1c6 Aug 28 07:10:14 2066 C:\Windows\SYSTEM32\ntdll.dll
            7ff908360000 e35abded Nov 14 12:34:53 2090 C:\Windows\System32\KERNEL32.DLL
            7ff907aa0000 e7e53a4e Apr 14 07:59:26 2093 C:\Windows\System32\KERNELBASE.dll
            7ff909150000 90a2bc88 Nov 23 03:10:00 2046 C:\Windows\System32\USER32.dll
            7ff9081b0000 0dcd0213 May 03 13:26:59 1977 C:\Windows\System32\win32u.dll
            7ff90a0c0000 3ee1d71f Jun 07 05:14:23 2003 C:\Windows\System32\GDI32.dll
            7ff9078e0000 94124ede Sep 20 08:16:46 2048 C:\Windows\System32\gdi32full.dll
            7ff907d80000 39255ccf May 19 08:25:03 2000 C:\Windows\System32\msvcp_win.dll
            7ff907e20000 2bd748bf Apr 22 18:39:11 1993 C:\Windows\System32\ucrtbase.dll
</code></pre><p>Many other drivers and system components, by registering process-creation notifications, can choose to create their own data structure to store information on a per-process basis. The executive functions <code>PsSetCreateProcessNotifyRoutineEx</code> and <code>PsSetCreateProcessNotifyRoutineEx2</code> allow this and are documented in WDK. This technique might find its use in AV, EDR/XDR implementations.</p>
<p>You can see the contents of <code>nt!_EPROCESS</code> structure in <code>lkd</code> (Kernel Debugger). <code>dt nt!_EPROCESS</code> lists all fields of <code>nt!_EPROCESS</code> structure and their offsets in hexadecimal. Here&rsquo;s what it looks like -&gt;</p>
<pre tabindex="0"><code class="language-dbgcmd" data-lang="dbgcmd">lkd&gt; dt nt!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   +0x438 ProcessLock      : _EX_PUSH_LOCK
   +0x440 UniqueProcessId  : Ptr64 Void
   ...
   +0x520 SectionBaseAddress : Ptr64 Void
   +0x528 Cookie           : Uint4B
   +0x530 WorkingSetWatch  : Ptr64 _PAGEFAULT_HISTORY
   ...
   +0xb8c MinimalTerminate : Pos 1, 1 Bit
   +0xb90 SyscallUsage     : Uint4B
   +0xb90 SyscallUsageValues : &lt;unnamed-tag&gt;
</code></pre><blockquote>
<p>Usually, you&rsquo;ll find <code>EPROCESS</code> not <code>nt!_EPROCESS</code> that&rsquo;s because in the kernel debugger, the latter is the symbol for the former, which is used for identification of functions, variables, and structures during debugging.</p>
</blockquote>
<p><code>dt</code> (display type) also shows specific contents of one or multiple fields by typing their names following the structure name. Like so -&gt;</p>
<pre tabindex="0"><code class="language-dbgcmd" data-lang="dbgcmd">lkd&gt; dt nt!_EPROCESS ProcessLock
   +0x438 ProcessLock : _EX_PUSH_LOCK
</code></pre><p>In the output above, the command examines <code>ProcessLock</code> (<code>_EX_PUSH_LOCK</code>) field.</p>
<p>To see a list of kernel structures use <code>dt nt!_*</code>. Note that <code>ntkrnlmp</code> is the internal name of the 64-bit kernel.</p>
<pre tabindex="0"><code class="language-dbgcmd" data-lang="dbgcmd">lkd&gt; dt nt!_*
   ntkrnlmp!_LIST_ENTRY
   ntkrnlmp!_LIST_ENTRY
   ntkrnlmp!_SINGLE_LIST_ENTRY
   ntkrnlmp!_UNICODE_STRING
   ntkrnlmp!_STRING
   ntkrnlmp!_RTL_QUERY_REGISTRY_TABLE
   ntkrnlmp!_LARGE_INTEGER
   ntkrnlmp!_ULARGE_INTEGER
   ntkrnlmp!_RTL_BITMAP
   ntkrnlmp!_KFLOATING_SAVE
   ntkrnlmp!_EXT_SET_PARAMETERS_V0
   ntkrnlmp!_POOL_TYPE
   ntkrnlmp!_EX_POOL_PRIORITY
   ntkrnlmp!_FAST_MUTEX
   ntkrnlmp!_EVENT_TYPE
   ...
   ntkrnlmp!_KINTERRUPT
   ...
</code></pre><p>The last structure (in the snipped output above) is <code>ntkrnlmp!_KINTERRUPT</code>. This <code>struct</code> contains pointers to all <strong>Interrupt Service Routines</strong> (ISR) registered by the kernel. ISRs execute on the CPU whenever an Interrupt or Exception occurs. All ISRs are pointed to by something called an <strong>Interrupt Descriptor Table</strong> or IDT, which is a CPU-defined data structure. ISRs tell the CPU what code to execute when it encounters an interrupt.</p>
<p>You can view the contents of the IDT, including information on what trap handlers Windows has assigned to interrupts (including exceptions and IRQs), using the <code>!idt</code> command in <code>lkd</code>.</p>
<pre tabindex="0"><code class="language-dbgcmd" data-lang="dbgcmd">lkd&gt; !idt

   Dumping IDT: fffff80219b1d000

   00:   fffff80216939100 nt!KiDivideErrorFaultShadow
   01:   fffff80216939180 nt!KiDebugTrapOrFaultShadow Stack = 0xFFFFF80219B219D0
   02:   fffff80216939240 nt!KiNmiInterruptShadow  Stack = 0xFFFFF80219B217D0
   ...
   07:   fffff802169394c0 nt!KiNpxNotAvailableFaultShadow
   08:   fffff80216939540 nt!KiDoubleFaultAbortShadow Stack = 0xFFFFF80219B213D0
   09:   fffff802169395c0 nt!KiNpxSegmentOverrunAbortShadow
   0a:   fffff80216939640 nt!KiInvalidTssFaultShadow
   0b:   fffff802169396c0 nt!KiSegmentNotPresentFaultShadow
   ...
   61:   fffff8021693a5c8 0xfffff80218355b20 (KINTERRUPT ffffb081807fec80)
   62:   fffff8021693a5d0 0xfffff802191df2a0 (KINTERRUPT ffffb081807fe640)
   ...
   e3:   fffff8021693a9d8 nt!HalpInterruptDeferredRecoveryService (KINTERRUPT fffff80216d38f80)
   fd:   fffff8021693aaa8 nt!HalpTimerProfileInterrupt (KINTERRUPT fffff80216d399a0)
   fe:   fffff8021693aab0 nt!HalpPerfInterrupt (KINTERRUPT fffff80216d39640)
</code></pre><blockquote>
<p>Traps are a superset of Interrupts and Exceptions, a trap frame stores thread context and is a subset of the thread&rsquo;s complete execution context. The kernel also treats system services as exceptions (although they are also technically system traps).</p>
</blockquote>
<p>The IDT has 256 entries, each one of which points to an ISR. The interrupt vector is the index of a particular slot in the IDT. The <code>nt!_KINTERRUPT</code> structure represents a driver&rsquo;s registration of an ISR for one of these vectors.</p>
<p>Use the <code>-r</code> flag to recursively examine all structures within <code>nt!_KINTERRUPT</code>, a number after <code>-r</code> determines the depth of recursion.</p>
<pre tabindex="0"><code class="language-dbgcmd" data-lang="dbgcmd">lkd&gt; dt nt!_KINTERRUPT -r
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x008 InterruptListEntry : _LIST_ENTRY
      +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x008 Blink            : Ptr64 _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
   +0x018 ServiceRoutine   : Ptr64     unsigned char 
   +0x020 MessageServiceRoutine : Ptr64     unsigned char 
   +0x028 MessageIndex     : Uint4B
   +0x030 ServiceContext   : Ptr64 Void
   +0x038 SpinLock         : Uint8B
   ...
</code></pre><p>Note the repeated occurrence of <code>Flink</code> (<code>struct _LIST_ENTRY *Flink</code>) and <code>Blink</code> (<code>struct _LIST_ENTRY *Blink</code>) fields. This makes sense as the kernel uses a circular doubly linked-list, called <code>ActiveProcessLink</code> for internal data structures. Each field is of the type <code>LIST_ENTRY</code> (<code>typedef struct _LIST_ENTRY LIST_ENTRY, *PLIST_ENTRY</code>). <code>Flink</code> points to the next node, while <code>Blink</code> points to the previous one.</p>
<p>All <code>nt!_EPROCESS</code> structures are similarly linked to form <code>ActiveProcessLink</code> with the <code>ListHead</code> stored in <code>nt!PsActiveProcessHead</code>. <code>!process</code> displays information from <code>nt!_EPROCESS</code> structure.</p>
<p>I noted that if recursion depth is increased to <code>-r 4</code>, it breaks the output -&gt;</p>
<pre tabindex="0"><code class="language-dbgcmd" data-lang="dbgcmd">lkd&gt; dt nt!_KINTERRUPT -r 4
   +0x000 Type             : ??
   +0x002 Size             : ??
   +0x008 InterruptListEntry : _LIST_ENTRY
      +0x000 Flink            : ???? 
      +0x008 Blink            : ???? 
   +0x018 ServiceRoutine   : ???? 
   +0x020 MessageServiceRoutine : ???? 
   +0x028 MessageIndex     : ??
   ...
   +0x0b0 IsrDpcStats      : _ISRDPCSTATS
      +0x000 IsrTime          : ??
      +0x008 IsrTimeStart     : ??
      +0x010 IsrCount         : ??
      +0x018 DpcTime          : ??
      +0x020 DpcTimeStart     : ??
      +0x028 DpcCount         : ??
      +0x030 IsrActive        : ??
      +0x031 Reserved         : [7]  &#34;--- memory read error at address 0x00000000`000000e5 ---&#34;
      +0x038 DpcWatchdog      : _ISRDPCSTATS_SEQUENCE
         +0x000 SequenceNumber   : ??
         +0x008 IsrTime          : ??
         +0x010 IsrCount         : ??
         +0x018 DpcTime          : ??
         +0x020 DpcCount         : ??
   +0x110 RedirectObject   : ???? 
   +0x118 Padding          : [8]  &#34;--- memory read error at address 0x00000000`0000011c ---&#34;
Memory read error 0000000000000114
</code></pre><p>The (probable!) cause might be that the memory indicated by <code>??</code> is uncommitted or de-allocated. As a process&rsquo; memory remains virtual unless <code>VirtualAlloc</code> allocates memory and zero-initializes it.</p>
<blockquote>
<p>I encourage you to experiment with <code>lkd</code> to become familiar with the syntax. <a href="https://learn.microsoft.com/en-us/windows-hardware/drivers/debugger/getting-started-with-windbg--kernel-mode-">Here</a> is the resource you might need.</p>
</blockquote>
<p>A process can be created using several WinAPI functions -&gt;</p>
<ol>
<li>
<p><code>CreateProcessA</code> -&gt; Most basic function which attempts to create a process and its primary thread with the same access token as the creating process. If a different token is required, <code>CreateProcessAsUser</code> can be used.</p>
</li>
<li>
<p><code>CreateProcessWithTokenW</code> -&gt; Part of the <code>advapi32.dll</code>, it is similar to <code>CreateProcessAsUser</code> the difference being the privileges required for the caller.</p>
</li>
<li>
<p><code>CreateProcessWithLogonW</code> -&gt; A handy shortcut to log on with a given user&rsquo;s credentials (user, domain, and password).</p>
</li>
</ol>
<p>All of the above have different use cases but eventually, all execution paths lead to <code>CreateProcessInternal</code> which calls <code>NtCreateUserProcess</code> (part of) which makes the transition to kernel mode and continues the kernel mode part of the process creation with the same name. As the name suggests, <code>NtCreateUserProcess</code> creates a user process. A user cannot create a native process, such as <code>smss.exe</code> and <code>csrss.exe</code>, as <code>CreateProcessInternal</code> function will reject images with native subsystem image type.</p>
<p>Apart from NT Processes, the Kernel Executive supports additional processes, that are created bypassing WinAPI, such as Native processes, Minimal, or Pico Processes. These would be beyond the scope of this post.</p>
<blockquote>
<p>You might be following along in a VM. If you are using VMware, you might notice performance slowdowns or hangs, which can get quite frustrating. There is a good way to get more performance!</p>
<ul>
<li>If you&rsquo;re using VMWare Player, make sure the VM is &ldquo;Shut Down&rdquo; and not &ldquo;Suspended&rdquo;. Then, navigate to the Virtual Machine working directory. Locate the config file <code>.vmx</code>. Open that in an editor and add the following line to it -&gt; <code>ulm.disableMitigations = &quot;TRUE&quot;</code>. This will disable side-channel mitigations applied to your VM.</li>
<li>If you&rsquo;re using Workstation pro, then you can directly disable side-channel mitigations in &ldquo;Edit Virtual Machine Settings&rdquo;.</li>
</ul>
</blockquote>
<h3 id="threads">Threads<a href="#threads" class="hanchor" ariaLabel="Anchor">&#8983;</a> </h3>
<p>A thread is a subcomponent of a process that does the actual execution. A process contains threads (at a minimum, 1 thread). Threads have their address space isolated from each other and share a common address space of the process. At OS-level, a Windows thread is represented by an executive thread object. This object encapsulates <code>nt!_ETHREAD</code> (which is also an opaque kernel structure) which contains, among others, <code>nt!_KTHREAD</code> structure as its first member. <code>nt!_KTHREAD</code> points to several other structures all of which reside in system address space, with the exception of <strong>Thread Environment Block</strong> (TEB). TEB, like PEB, resides in userspace.</p>
<p>The Windows subsystem process (csrss) maintains a parallel data structure <code>CSR_THREAD</code>. For threads that have called a Windows subsystem <code>USER</code> or <code>GDI</code> function, the kernel-mode portion of the Windows Subsystem (<code>Win32k.sys</code>) maintains a per-thread data structure (<code>W32THREAD</code>) that the <code>KTHREAD</code> structure points to.</p>
<p>The simplest function to create a thread is <code>CreateThread</code> function which creates a thread in the current process. On successful completion, a non-zero handle is returned, and a unique thread ID if requested by the caller.</p>
<p><code>CreateRemoteThread</code> is used to inject a thread into another process. It can be used by the debugger to force a break in a debugged process. The debugger injects the thread which immediately causes a breakpoint by calling the <code>DebugBreak</code> function. Another use can be to obtain information about a process when running within the target process context, this can be done for legitimate or malicious purposes.</p>
<p>Going back to <code>lkd</code>, you can use it to examine <code>nt!_ETHREAD</code> -&gt;</p>
<pre tabindex="0"><code class="language-dbgcmd" data-lang="dbgcmd">lkd&gt; dt nt!_ETHREAD
   +0x000 Tcb              : _KTHREAD
   +0x480 CreateTime       : _LARGE_INTEGER
   +0x488 ExitTime         : _LARGE_INTEGER
   +0x488 KeyedWaitChain   : _LIST_ENTRY
   +0x498 PostBlockList    : _LIST_ENTRY
   ...
   +0x560 DisableDynamicCodeOptOut : Pos 18, 1 Bit
   +0x560 ExplicitCaseSensitivity : Pos 19, 1 Bit
   +0x560 PicoNotifyExit   : Pos 20, 1 Bit
   +0x560 DbgWerUserReportActive : Pos 21, 1 Bit
   +0x560 ForcedSelfTrimActive : Pos 22, 1 Bit
   +0x560 SamplingCoverage : Pos 23, 1 Bit
   ...
   +0x6b8 LastExpectedRunTime : Uint4B
   +0x6bc LastSoftParkElectionRunTime : Uint4B
   +0x6c0 LastSoftParkElectionGeneration : Uint8B
   +0x6c8 LastSoftParkElectionGroupAffinity : _GROUP_AFFINITY
   +0x6d8 UpdateTebListEntry : _SINGLE_LIST_ENTRY
</code></pre><p>Listed above are the structures inside <code>nt!_ETHREAD</code> and their types. For instance, <code>Tcb</code> is of type <code>_KTHREAD</code>, and <code>CreateTime</code> is an instance of <code>_LARGE_INTEGER</code> structure.</p>
<p><code>!thread</code> can be used to view information about a thread. But this can only be used in kernel-mode debugging.</p>
<pre tabindex="0"><code class="language-dbgcmd" data-lang="dbgcmd">lkd&gt; !thread
   THREAD ffff830869dec080  Cid 24cc.0250  Teb: 0000003a3cb00000 Win32Thread: ffff83086dfe3da0 WAIT: (WrUserRequest) UserMode Non-Alertable
      ffff83086fb5f280  QueueObject
   IRP List:
      ffff83086eac8ba0: (0006,0358) Flags: 00060800  Mdl: 00000000
   Not impersonating
   DeviceMap                 ffffe586f8dcf270
   Owning Process            ffff83086fea80c0       Image:         DbgX.Shell.exe
   Attached Process          N/A            Image:         N/A
